app/Controllers/SigninController.php

SELECT *
FROM `users`
WHERE `email` = 'masum@gmail.com'
 LIMIT 1
---
    public function login(){
           $session = session();
           $userModel=new UserModel();
          $email= $this->request->getVar('email');
          $formpass= $this->request->getVar('password');
           $data=$userModel->where('email',$email)->first();